## Groupby exercise

In [2]:
import pandas as pd

### import the datset drinks.csv and load it using pandas.

In [58]:
df=pd.read_csv("/Users/Chhimi/Desktop/Data/assignmet_file/drinks.csv", index_col='continent')
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,,
AS,Afghanistan,0,0,0,0.0
EU,Albania,89,132,54,4.9
AF,Algeria,25,0,14,0.7
EU,Andorra,245,138,312,12.4
AF,Angola,217,57,45,5.9

### Which continent drinks more beer on average?

In [60]:
df.groupby('continent')['beer_servings'].mean()

In [61]:
df.groupby('continent')['beer_servings'].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

### For each continent print the statistics for wine consumption.

In [5]:
df.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Print the mean alcohol consumption per continent for every column

In [9]:
df.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Print the mean, min and max values for spirit consumption.

In [8]:
df.groupby('continent').spirit_servings.agg(['mean','min','max']) #agg- to add the multiple functions inside

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

## load a new data file u.user and read it

In [7]:
users=pd.read_csv("/Users/Chhimi/Desktop/Data/assignmet_file/u.user", sep="|",index_col= "user_id")
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Discover what is the mean age per occupation

In [8]:
users_grp= users.groupby(['occupation'] ) # split---> apply ---> combine
users_grp

In [52]:
users_grp['age'].value_counts().head()

occupation     age
administrator  30     5
               51     5
               28     4
               35     4
               38     4
Name: age, dtype: int64

In [9]:
users_grp['age'].mean().head()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
Name: age, dtype: float64

### Discover the Male ratio per occupation and sort it from the most to the least

### For each occupation, calculate the minimum and maximum ages

In [16]:
users_grp.agg(['max','min']).head()  # agg() is used to pass a function or list of function to be applied on a series or even each element of series separately

              age     gender     zip_code
              max min    max min      max    min
occupation
administrator  70  21      M   F    V1G4L  02154
artist         48  19      M   F    V5A2B  01945
doctor         64  28      M   M    97405  47401
educator       63  23      M   F    M4J2K  01602
engineer       70  22      M   F    T8H1N  00000

### For each combination of occupation and gender, calculate the mean age without heirarchical indexing

In [17]:
users_grp.groupby(["occupation", "gender"]).age.mean()

AttributeError: 'DataFrameGroupBy' object has no attribute 'groupby'

### For each occupation present the percentage of women and men

In [63]:
users_grp['age'].value_counts(normalize=True)

occupation     age
administrator  30     0.063291
               51     0.063291
               28     0.050633
               35     0.050633
               38     0.050633
                        ...
writer         37     0.022222
               43     0.022222
               51     0.022222
               56     0.022222
               60     0.022222
Name: age, Length: 429, dtype: float64

### Iterate over a group and print the name and the whole data from the occupations